---
title: FieldBuilder
classe: Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder
namespace: Autodesk.Revit.DB.ExtensibleStorage
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# FieldBuilder

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `fieldBuilder.IsValidObject` | Boolean |
| `Void Dispose()` | `fieldBuilder.Dispose()` | Void |
| `Boolean NeedsSubSchemaGUID()` | `fieldBuilder.NeedsSubSchemaGUID()` | Boolean |
| `Boolean NeedsUnits()` | `fieldBuilder.NeedsUnits()` | Boolean |
| `Boolean Ready()` | `fieldBuilder.Ready()` | Boolean |
| `FieldBuilder SetDocumentation(String)` | `fieldBuilder.SetDocumentation(documentation)` | FieldBuilder |
| `FieldBuilder SetSpec(ForgeTypeId)` | `fieldBuilder.SetSpec(specTypeId)` | FieldBuilder |
| `FieldBuilder SetSubSchemaGUID(Guid)` | `fieldBuilder.SetSubSchemaGUID(guid)` | FieldBuilder |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```